archive/before-2018-11-10/source/2018-10-14-deal_with_mail_by_mbsync_mu4e_emacs.org
#+AUTHOR: Peng Xie
#+EMAIL: pengpengxpplay@gmail.com
#+SETUPFILE: theme.setup
#+OPTIONS: ^:{}
#+TITLE: 2018-10-14-deal_with_mail_by_mbsync_mu4e_emacs.org

