archive/before-2018-11-10/source/2018-10-14-deal_with_mail_by_mbsync_mu4e_emacs.org
* 下载邮件
  下载邮件到本地，之前使用过 =offlineimap= 和 =fetchmail= 。这次换了电脑，
  折腾了一下 mbsync 。

  #+BEGIN_SRC conf-space
Expunge None
Create Slave               # 只在Slave上创建新文件夹, 不对Master做操作

# --------------------------------------------------------------------
# ACCOUNT INFORMATION
# --------------------------------------------------------------------
IMAPAccount gmail
Host imap.gmail.com
Timeout 0                       # 0表示不超时
User pengpengxpplay@gmail.com
PassCmd "security find-generic-password -s mail_gmail -w"
AuthMechs PLAIN # google邮箱开启允许安全性较低的应用登陆时用这个选项可以成功登陆
SSLType IMAPS   # 993端口用这个选项

IMAPAccount sinapub
Host imap.sina.com
Port 993
User pengpengxppub@sina.com
PassCmd "security find-generic-password -s mail_sinapub -w"
AuthMechs LOGIN              # 普通的993端口的imap使用这个方式就可以了
SSLType IMAPS
# CertificateFile /Users/pengpengxp/.pem/sina.pem

IMAPAccount sinapri
Host imap.sina.com
Port 993
User pengpengxppri@sina.com
PassCmd "security find-generic-password -s mail_sinapri -w"
AuthMechs LOGIN
SSLType IMAPS

IMAPAccount qq
Host imap.qq.com
Port 993
Timeout 0
User 474364048@qq.com
PassCmd "security find-generic-password -s mail_qq -w"
AuthMechs LOGIN
SSLType IMAPS

IMAPAccount cdyq
Host pop.yuqiinf.com
Port 993
Timeout 0
User xiepeng@yuqiinf.com
PassCmd "security find-generic-password -s mail_cdyq -w"
AuthMechs LOGIN
SSLType IMAPS

# ################ gmail store begin ################
# REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)
IMAPStore gmail-remote
Account gmail

# LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p Maildir/gmail)
MaildirStore gmail-local
Path ~/Maildir/gmail/     # 这个目录需要先用 mkdir -p ~/Maildir/gmail/
Inbox ~/Maildir/gmail/inbox
# ################ gmail store end ################

# ################ sinapub store begin ################
IMAPStore sinapub-remote
Account sinapub

MaildirStore sinapub-local
Path ~/Maildir/sinapub/
Inbox ~/Maildir/sinapub/inbox
# ################ sinapub store end ################

# ################ sinapri store begin ################
IMAPStore sinapri-remote
Account sinapri

MaildirStore sinapri-local
Path ~/Maildir/sinapri/
Inbox ~/Maildir/sinapri/inbox
# ################ sinapri store end ################

# ################ qq store begin ################
IMAPStore qq-remote
Account qq

MaildirStore qq-local
Path ~/Maildir/qq/
Inbox ~/Maildir/qq/inbox
# ################ qq store end ################

# ################ cdyq store begin ################
IMAPStore cdyq-remote
Account cdyq

MaildirStore cdyq-local
Path ~/Maildir/cdyq/
Inbox ~/Maildir/cdyq/inbox
# ################ cdyq store end ################

# --------------------------------------------------------------------
# CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS
#
# CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl
# FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:
#
# 1 "*" TO MATCH EVERYTHING
# 2 "!DIR" TO EXCLUDE "DIR"
# 3 "DIR" TO MATCH DIR
#
# FOR INSTANCE IN THE SPECIFICATION BELOW:
#
# gmail-inbox gets the folder INBOX, ARCHIVE, and everything under
# "ARCHIVE*"
#
# gmail-trash gets only the "[Gmail]/Trash" folder and stores it to
# the local "trash" folder
# --------------------------------------------------------------------

Channel gmail-inbox
Master :gmail-remote:
Slave :gmail-local:
Patterns "INBOX" "Arch*"
Expunge Slave
Sync Pull
CopyArrivalDate yes #将原邮箱的时间信息也同步过来, 否则以拉取的时刻上传, 不方便

Channel gmail-trash
Master :gmail-remote:"[Gmail]/Trash"
Slave :gmail-local:trash
Create Both
Expunge Both
SyncState *

Channel gmail-sent
Master :gmail-remote:"[Gmail]/Sent Mail"
Slave :gmail-local:sent
Create Both
Expunge Both
SyncState *

Channel sinapub-inbox
Master :sinapub-remote:
Slave :sinapub-local:
Patterns "INBOX" "Arch*"
Expunge Slave
Sync Pull
CopyArrivalDate yes

Channel sinapri-inbox
Master :sinapri-remote:
Slave :sinapri-local:
Patterns "INBOX" "Arch*"
Expunge Slave
Sync Pull
CopyArrivalDate yes

Channel qq-inbox
Master :qq-remote:
Slave :qq-local:
Patterns "INBOX" "Arch*" "Sent*"
Expunge Slave
Sync Pull
CopyArrivalDate yes

Channel qq-sent
Master :qq-remote:
Slave :qq-local:sent
Patterns "Sent*"
Expunge Slave
Sync Pull
CopyArrivalDate yes

Channel cdyq-inbox
Master :cdyq-remote:
Slave :cdyq-local:
Patterns "INBOX" "Arch*"
Expunge Slave
Sync Pull
CopyArrivalDate yes

# --------------------------------------------------------------------
# GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE
# MBSYNC ON A GROUP TO SYNC ALL CHANNELS
#
# FOR INSTANCE: "mbsync gmail" GETS MAIL FROM
# "gmail-inbox", "gmail-sent", and "gmail-trash"
# --------------------------------------------------------------------

Group gmail
Channel gmail-inbox
Channel gmail-sent
Channel gmail-trash

Group all-mail
Channel qq-inbox
Channel qq-sent
Channel sinapub-inbox
Channel sinapri-inbox
Channel cdyq-inbox

  #+END_SRC

  mbsync配置大体分三块：
  1. 账户：这个区域设置用户的账户信息，就包括用户名密码。这里的选项很
     重要，设置正确才能登陆成功。这里主要配置了gmail和一个普通的imap邮
     箱。
     1. gmail： =AuthMechs PLAIN= 这个选项设对后，在google账户中设置允
        许安全性较低的应用访问。就搞定啦。
     2. 普通imap账户，我试了qq和新浪邮箱以及一个公司的邮箱，按照上面的
        配置都是可以的（都是登陆的993端口）。注意 =AuthMechs LOGIN= 这
        个选项。普通imap邮箱需要设置为这个才可以登陆。如果imap server
        没有对应的pem，可以参考 [[#no_pem]] 。
  2. STORES： 我理解这里就是指定一对一对的remote和local。对于我们只需
     要拉邮件的用户用说，remote就直接设置为上面配置好的账户即可。local
     就是设置这些邮件拉下来对应存在本地哪个目录。
  3. channel: channel的名字可以直接供mbsync命令行使用，比如可以直接
     =mbsync gmail-inbox= 这个channel。它主要指定一个master和slave，这
     里其实就是一个remote和local。
     1. patterns表示匹配， =Patterns "INBOX" "Arch*"= 表示匹配inbox和
        所有归档的邮件。
     2. [ ] Sync:
     3. [ ] Expunge:
  4. group:这个简单，把多个channel合到一个group，直接 =mbsync
     <group-name>= 就可以执行到所有group下面的所有channel。

