archive/before-2018-11-10/2018-10-14-deal_with_mail_by_mbsync_mu4e_emacs.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga6c97b0">1. 下载邮件</a></li>
<li><a href="#orgf228b24">2. 使用mu进行index</a></li>
<li><a href="#orgbd09843">3. 使用mu4e</a></li>
<li><a href="#org11782c9">4. MISC</a>
<ul>
<li><a href="#no_pem">4.1. <span class="todo TODO">TODO</span> 有些imap可能没有pem文件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga6c97b0" class="outline-2">
<h2 id="orga6c97b0"><span class="section-number-2">1</span> 下载邮件</h2>
<div class="outline-text-2" id="text-1">
<p>
下载邮件到本地，之前使用过 <code>offlineimap</code> 和 <code>fetchmail</code> 。这次换了电脑，
折腾了一下 mbsync 。
</p>

<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #ff8700;">Expunge</span> None
<span style="color: #ff8700;">Create</span> Slave               <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#21482;&#22312;Slave&#19978;&#21019;&#24314;&#26032;&#25991;&#20214;&#22841;, &#19981;&#23545;Master&#20570;&#25805;&#20316;</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">--------------------------------------------------------------------</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">ACCOUNT INFORMATION</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">--------------------------------------------------------------------</span>
<span style="color: #ff8700;">IMAPAccount</span> gmail
<span style="color: #ff8700;">Host</span> imap.gmail.com
<span style="color: #ff8700;">Timeout</span> 0                       <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">0&#34920;&#31034;&#19981;&#36229;&#26102;</span>
<span style="color: #ff8700;">User</span> pengpengxpplay@gmail.com
<span style="color: #ff8700;">PassCmd</span> <span style="color: #ff4ea3;">"security find-generic-password -s mail_gmail -w"</span>
<span style="color: #ff8700;">AuthMechs</span> PLAIN <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">google&#37038;&#31665;&#24320;&#21551;&#20801;&#35768;&#23433;&#20840;&#24615;&#36739;&#20302;&#30340;&#24212;&#29992;&#30331;&#38470;&#26102;&#29992;&#36825;&#20010;&#36873;&#39033;&#21487;&#20197;&#25104;&#21151;&#30331;&#38470;</span>
<span style="color: #ff8700;">SSLType</span> IMAPS   <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">993&#31471;&#21475;&#29992;&#36825;&#20010;&#36873;&#39033;</span>

<span style="color: #ff8700;">IMAPAccount</span> sinapub
<span style="color: #ff8700;">Host</span> imap.sina.com
<span style="color: #ff8700;">Port</span> 993
<span style="color: #ff8700;">User</span> pengpengxppub@sina.com
<span style="color: #ff8700;">PassCmd</span> <span style="color: #ff4ea3;">"security find-generic-password -s mail_sinapub -w"</span>
<span style="color: #ff8700;">AuthMechs</span> LOGIN              <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#26222;&#36890;&#30340;993&#31471;&#21475;&#30340;imap&#20351;&#29992;&#36825;&#20010;&#26041;&#24335;&#23601;&#21487;&#20197;&#20102;</span>
<span style="color: #ff8700;">SSLType</span> IMAPS
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">CertificateFile /Users/pengpengxp/.pem/sina.pem</span>

<span style="color: #ff8700;">IMAPAccount</span> sinapri
<span style="color: #ff8700;">Host</span> imap.sina.com
<span style="color: #ff8700;">Port</span> 993
<span style="color: #ff8700;">User</span> pengpengxppri@sina.com
<span style="color: #ff8700;">PassCmd</span> <span style="color: #ff4ea3;">"security find-generic-password -s mail_sinapri -w"</span>
<span style="color: #ff8700;">AuthMechs</span> LOGIN
<span style="color: #ff8700;">SSLType</span> IMAPS

<span style="color: #ff8700;">IMAPAccount</span> qq
<span style="color: #ff8700;">Host</span> imap.qq.com
<span style="color: #ff8700;">Port</span> 993
<span style="color: #ff8700;">Timeout</span> 0
<span style="color: #ff8700;">User</span> 474364048@qq.com
<span style="color: #ff8700;">PassCmd</span> <span style="color: #ff4ea3;">"security find-generic-password -s mail_qq -w"</span>
<span style="color: #ff8700;">AuthMechs</span> LOGIN
<span style="color: #ff8700;">SSLType</span> IMAPS

<span style="color: #ff8700;">IMAPAccount</span> cdyq
<span style="color: #ff8700;">Host</span> pop.yuqiinf.com
<span style="color: #ff8700;">Port</span> 993
<span style="color: #ff8700;">Timeout</span> 0
<span style="color: #ff8700;">User</span> xiepeng@yuqiinf.com
<span style="color: #ff8700;">PassCmd</span> <span style="color: #ff4ea3;">"security find-generic-password -s mail_cdyq -w"</span>
<span style="color: #ff8700;">AuthMechs</span> LOGIN
<span style="color: #ff8700;">SSLType</span> IMAPS

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ gmail store begin ################</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">REMOTE STORAGE (USE THE IMAP ACCOUNT SPECIFIED ABOVE)</span>
<span style="color: #ff8700;">IMAPStore</span> gmail-remote
<span style="color: #ff8700;">Account</span> gmail

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">LOCAL STORAGE (CREATE DIRECTORIES with mkdir -p Maildir/gmail)</span>
<span style="color: #ff8700;">MaildirStore</span> gmail-local
<span style="color: #ff8700;">Path</span> ~/Maildir/gmail/     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#20010;&#30446;&#24405;&#38656;&#35201;&#20808;&#29992; mkdir -p ~/Maildir/gmail/</span>
<span style="color: #ff8700;">Inbox</span> ~/Maildir/gmail/inbox
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ gmail store end ################</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ sinapub store begin ################</span>
<span style="color: #ff8700;">IMAPStore</span> sinapub-remote
<span style="color: #ff8700;">Account</span> sinapub

<span style="color: #ff8700;">MaildirStore</span> sinapub-local
<span style="color: #ff8700;">Path</span> ~/Maildir/sinapub/
<span style="color: #ff8700;">Inbox</span> ~/Maildir/sinapub/inbox
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ sinapub store end ################</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ sinapri store begin ################</span>
<span style="color: #ff8700;">IMAPStore</span> sinapri-remote
<span style="color: #ff8700;">Account</span> sinapri

<span style="color: #ff8700;">MaildirStore</span> sinapri-local
<span style="color: #ff8700;">Path</span> ~/Maildir/sinapri/
<span style="color: #ff8700;">Inbox</span> ~/Maildir/sinapri/inbox
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ sinapri store end ################</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ qq store begin ################</span>
<span style="color: #ff8700;">IMAPStore</span> qq-remote
<span style="color: #ff8700;">Account</span> qq

<span style="color: #ff8700;">MaildirStore</span> qq-local
<span style="color: #ff8700;">Path</span> ~/Maildir/qq/
<span style="color: #ff8700;">Inbox</span> ~/Maildir/qq/inbox
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ qq store end ################</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ cdyq store begin ################</span>
<span style="color: #ff8700;">IMAPStore</span> cdyq-remote
<span style="color: #ff8700;">Account</span> cdyq

<span style="color: #ff8700;">MaildirStore</span> cdyq-local
<span style="color: #ff8700;">Path</span> ~/Maildir/cdyq/
<span style="color: #ff8700;">Inbox</span> ~/Maildir/cdyq/inbox
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">################ cdyq store end ################</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">--------------------------------------------------------------------</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">CONNECTIONS SPECIFY LINKS BETWEEN REMOTE AND LOCAL FOLDERS</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">CONNECTIONS ARE SPECIFIED USING PATTERNS, WHICH MATCH REMOTE MAIl</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">FOLDERS. SOME COMMONLY USED PATTERS INCLUDE:</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">1 "*" TO MATCH EVERYTHING</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">2 "!DIR" TO EXCLUDE "DIR"</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">3 "DIR" TO MATCH DIR</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">FOR INSTANCE IN THE SPECIFICATION BELOW:</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">gmail-inbox gets the folder INBOX, ARCHIVE, and everything under</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">"ARCHIVE*"</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">gmail-trash gets only the "[Gmail]/Trash" folder and stores it to</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the local "trash" folder</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">--------------------------------------------------------------------</span>

<span style="color: #ff8700;">Channel</span> gmail-inbox
<span style="color: #ff8700;">Master</span> :gmail-remote:
<span style="color: #ff8700;">Slave</span> :gmail-local:
<span style="color: #ff8700;">Patterns</span> <span style="color: #ff4ea3;">"INBOX"</span> <span style="color: #ff4ea3;">"Arch*"</span>
<span style="color: #ff8700;">Expunge</span> Slave
<span style="color: #ff8700;">Sync</span> Pull
<span style="color: #ff8700;">CopyArrivalDate</span> yes <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">&#23558;&#21407;&#37038;&#31665;&#30340;&#26102;&#38388;&#20449;&#24687;&#20063;&#21516;&#27493;&#36807;&#26469;, &#21542;&#21017;&#20197;&#25289;&#21462;&#30340;&#26102;&#21051;&#19978;&#20256;, &#19981;&#26041;&#20415;</span>

<span style="color: #ff8700;">Channel</span> gmail-trash
<span style="color: #ff8700;">Master</span> :gmail-remote:<span style="color: #ff4ea3;">"[Gmail]/Trash"</span>
<span style="color: #ff8700;">Slave</span> :gmail-local:trash
<span style="color: #ff8700;">Create</span> Both
<span style="color: #ff8700;">Expunge</span> Both
<span style="color: #ff8700;">SyncState</span> *

<span style="color: #ff8700;">Channel</span> gmail-sent
<span style="color: #ff8700;">Master</span> :gmail-remote:<span style="color: #ff4ea3;">"[Gmail]/Sent Mail"</span>
<span style="color: #ff8700;">Slave</span> :gmail-local:sent
<span style="color: #ff8700;">Create</span> Both
<span style="color: #ff8700;">Expunge</span> Both
<span style="color: #ff8700;">SyncState</span> *

<span style="color: #ff8700;">Channel</span> sinapub-inbox
<span style="color: #ff8700;">Master</span> :sinapub-remote:
<span style="color: #ff8700;">Slave</span> :sinapub-local:
<span style="color: #ff8700;">Patterns</span> <span style="color: #ff4ea3;">"INBOX"</span> <span style="color: #ff4ea3;">"Arch*"</span>
<span style="color: #ff8700;">Expunge</span> Slave
<span style="color: #ff8700;">Sync</span> Pull
<span style="color: #ff8700;">CopyArrivalDate</span> yes

<span style="color: #ff8700;">Channel</span> sinapri-inbox
<span style="color: #ff8700;">Master</span> :sinapri-remote:
<span style="color: #ff8700;">Slave</span> :sinapri-local:
<span style="color: #ff8700;">Patterns</span> <span style="color: #ff4ea3;">"INBOX"</span> <span style="color: #ff4ea3;">"Arch*"</span>
<span style="color: #ff8700;">Expunge</span> Slave
<span style="color: #ff8700;">Sync</span> Pull
<span style="color: #ff8700;">CopyArrivalDate</span> yes

<span style="color: #ff8700;">Channel</span> qq-inbox
<span style="color: #ff8700;">Master</span> :qq-remote:
<span style="color: #ff8700;">Slave</span> :qq-local:
<span style="color: #ff8700;">Patterns</span> <span style="color: #ff4ea3;">"INBOX"</span> <span style="color: #ff4ea3;">"Arch*"</span> <span style="color: #ff4ea3;">"Sent*"</span>
<span style="color: #ff8700;">Expunge</span> Slave
<span style="color: #ff8700;">Sync</span> Pull
<span style="color: #ff8700;">CopyArrivalDate</span> yes

<span style="color: #ff8700;">Channel</span> qq-sent
<span style="color: #ff8700;">Master</span> :qq-remote:
<span style="color: #ff8700;">Slave</span> :qq-local:sent
<span style="color: #ff8700;">Patterns</span> <span style="color: #ff4ea3;">"Sent*"</span>
<span style="color: #ff8700;">Expunge</span> Slave
<span style="color: #ff8700;">Sync</span> Pull
<span style="color: #ff8700;">CopyArrivalDate</span> yes

<span style="color: #ff8700;">Channel</span> cdyq-inbox
<span style="color: #ff8700;">Master</span> :cdyq-remote:
<span style="color: #ff8700;">Slave</span> :cdyq-local:
<span style="color: #ff8700;">Patterns</span> <span style="color: #ff4ea3;">"INBOX"</span> <span style="color: #ff4ea3;">"Arch*"</span>
<span style="color: #ff8700;">Expunge</span> Slave
<span style="color: #ff8700;">Sync</span> Pull
<span style="color: #ff8700;">CopyArrivalDate</span> yes

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">--------------------------------------------------------------------</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">GROUPS PUT TOGETHER CHANNELS, SO THAT WE CAN INVOKE</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">MBSYNC ON A GROUP TO SYNC ALL CHANNELS</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">FOR INSTANCE: "mbsync gmail" GETS MAIL FROM</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">"gmail-inbox", "gmail-sent", and "gmail-trash"</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">--------------------------------------------------------------------</span>

<span style="color: #ff8700;">Group</span> gmail
<span style="color: #ff8700;">Channel</span> gmail-inbox
<span style="color: #ff8700;">Channel</span> gmail-sent
<span style="color: #ff8700;">Channel</span> gmail-trash

<span style="color: #ff8700;">Group</span> all-mail
<span style="color: #ff8700;">Channel</span> qq-inbox
<span style="color: #ff8700;">Channel</span> qq-sent
<span style="color: #ff8700;">Channel</span> sinapub-inbox
<span style="color: #ff8700;">Channel</span> sinapri-inbox
<span style="color: #ff8700;">Channel</span> cdyq-inbox

</pre>
</div>

<p>
mbsync配置大体分三块：
</p>
<ol class="org-ol">
<li>账户：这个区域设置用户的账户信息，就包括用户名密码。这里的选项很
重要，设置正确才能登陆成功。这里主要配置了gmail和一个普通的imap邮
箱。
<ol class="org-ol">
<li>gmail： <code>AuthMechs PLAIN</code> 这个选项设对后，在google账户中设置允
许安全性较低的应用访问。就搞定啦。</li>
<li>普通imap账户，我试了qq和新浪邮箱以及一个公司的邮箱，按照上面的
配置都是可以的（都是登陆的993端口）。注意 <code>AuthMechs LOGIN</code> 这
个选项。普通imap邮箱需要设置为这个才可以登陆。如果imap server
没有对应的pem，可以参考 <a href="#no_pem">4.1</a> 。</li>
</ol></li>
<li>STORES： 我理解这里就是指定一对一对的remote和local。对于我们只需
要拉邮件的用户用说，remote就直接设置为上面配置好的账户即可。local
就是设置这些邮件拉下来对应存在本地哪个目录。</li>
<li>channel: channel的名字可以直接供mbsync命令行使用，比如可以直接
<code>mbsync gmail-inbox</code> 这个channel。它主要指定一个master和slave，这
里其实就是一个remote和local。
<ol class="org-ol">
<li>patterns表示匹配， <code>Patterns "INBOX" "Arch*"</code> 表示匹配inbox和
所有归档的邮件。</li>
<li class="off"><code>[&#xa0;]</code> Sync:</li>
<li class="off"><code>[&#xa0;]</code> Expunge:</li>
</ol></li>
<li>group:这个简单，把多个channel合到一个group，直接 <code>mbsync
     &lt;group-name&gt;</code> 就可以执行到所有group下面的所有channel。</li>
</ol>
</div>
</div>
