archive/before-2018-11-10/source/2018-10-14-deal_with_mail_by_mbsync_mu4e_emacs.org
* 使用mu进行index
  #+BEGIN_SRC sh
rm ~/.mu
mu index --rebuild -m ~/Maildir
  #+END_SRC

* 使用mu4e
  之前写过一篇 [[file:2017-08-24-emacs-use-mu4e.org][emacs-use-mu4e]] 。

* MISC
