archive/before-2018-11-10/2018-10-14-deal_with_mail_by_mbsync_mu4e_emacs.html

<div id="outline-container-orgf228b24" class="outline-2">
<h2 id="orgf228b24"><span class="section-number-2">2</span> 使用mu进行index</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">rm ~/.mu
mu index --rebuild -m ~/Maildir
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd09843" class="outline-2">
<h2 id="orgbd09843"><span class="section-number-2">3</span> 使用mu4e</h2>
<div class="outline-text-2" id="text-3">
<p>
之前写过一篇 <a href="2017-08-24-emacs-use-mu4e.html">emacs-use-mu4e</a> 。
</p>
</div>
</div>
